paparazzi/paparazzi/sw/airborne/subsystems/radio_control/cc2500_frsky/cc2500_smartport.c
#include "cc2500_compat.h"

#include "cc2500_rx.h"
#include "cc2500_settings.h"
#include "cc2500_smartport.h"

#include "subsystems/datalink/downlink.h"

#define UNUSED(x) (void)(x)

#ifdef USE_GPS
#undef USE_GPS
#endif

#define FSSP_DATAID_DOWNLINK 0x5015
smartPortDownlinkFn *smartPortDownlink = NULL;

// CAUTION: added DOWNLINK sensor to code below!
// CAUTION: LARGE PARTS OF THIS FILE ARE COMMENTED OUT!
// betaflight/src/main/telemetry/smartport.c @ 443869e
/*
 * This file is part of Cleanflight and Betaflight.
 *
 * Cleanflight and Betaflight are free software. You can redistribute
 * this software and/or modify this software under the terms of the
 * GNU General Public License as published by the Free Software
 * Foundation, either version 3 of the License, or (at your option)
 * any later version.
 *
 * Cleanflight and Betaflight are distributed in the hope that they
 * will be useful, but WITHOUT ANY WARRANTY; without even the implied
 * warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this software.
 *
 * If not, see <http://www.gnu.org/licenses/>.
 */

/*
 * SmartPort Telemetry implementation by frank26080115
 * see https://github.com/frank26080115/cleanflight/wiki/Using-Smart-Port
 */
#include <stdbool.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <math.h>

//#include "platform.h"
//
//#if defined(USE_TELEMETRY_SMARTPORT)
//
//#include "common/axis.h"
//#include "common/color.h"
//#include "common/maths.h"
//#include "common/utils.h"
//
//#include "config/feature.h"
//
//#include "drivers/accgyro/accgyro.h"
//#include "drivers/compass/compass.h"
//#include "drivers/sensor.h"
//#include "drivers/time.h"
//
//#include "fc/config.h"
//#include "fc/controlrate_profile.h"
//#include "fc/rc_controls.h"
//#include "fc/runtime_config.h"
//
//#include "flight/failsafe.h"
//#include "flight/imu.h"
//#include "flight/mixer.h"
//#include "flight/pid.h"
//#include "flight/position.h"
//
//#include "io/beeper.h"
//#include "io/gps.h"
//#include "io/motors.h"
//#include "io/serial.h"
//
//#include "msp/msp.h"
//
//#include "rx/rx.h"
//
//#include "pg/pg.h"
//#include "pg/pg_ids.h"
//#include "pg/rx.h"
//
//#include "sensors/acceleration.h"
//#include "sensors/adcinternal.h"
//#include "sensors/barometer.h"
//#include "sensors/battery.h"
//#include "sensors/boardalignment.h"
//#include "sensors/compass.h"
//#include "sensors/esc_sensor.h"
//#include "sensors/gyro.h"
//#include "sensors/sensors.h"
//
//#include "telemetry/msp_shared.h"
//#include "telemetry/smartport.h"
//#include "telemetry/telemetry.h"
//
//#define SMARTPORT_MIN_TELEMETRY_RESPONSE_DELAY_US 500

// these data identifiers are obtained from https://github.com/opentx/opentx/blob/master/radio/src/telemetry/frsky_hub.h
enum
{
    FSSP_DATAID_SPEED      = 0x0830 ,
    FSSP_DATAID_VFAS       = 0x0210 ,
    FSSP_DATAID_VFAS1      = 0x0211 ,
    FSSP_DATAID_VFAS2      = 0x0212 ,
    FSSP_DATAID_VFAS3      = 0x0213 ,
    FSSP_DATAID_VFAS4      = 0x0214 ,
    FSSP_DATAID_VFAS5      = 0x0215 ,
    FSSP_DATAID_VFAS6      = 0x0216 ,
    FSSP_DATAID_VFAS7      = 0x0217 ,
    FSSP_DATAID_VFAS8      = 0x0218 ,
    FSSP_DATAID_CURRENT    = 0x0200 ,
    FSSP_DATAID_CURRENT1   = 0x0201 ,
    FSSP_DATAID_CURRENT2   = 0x0202 ,
    FSSP_DATAID_CURRENT3   = 0x0203 ,
    FSSP_DATAID_CURRENT4   = 0x0204 ,
    FSSP_DATAID_CURRENT5   = 0x0205 ,
    FSSP_DATAID_CURRENT6   = 0x0206 ,
    FSSP_DATAID_CURRENT7   = 0x0207 ,
    FSSP_DATAID_CURRENT8   = 0x0208 ,
    FSSP_DATAID_RPM        = 0x0500 ,
    FSSP_DATAID_RPM1       = 0x0501 ,
    FSSP_DATAID_RPM2       = 0x0502 ,
    FSSP_DATAID_RPM3       = 0x0503 ,
    FSSP_DATAID_RPM4       = 0x0504 ,
    FSSP_DATAID_RPM5       = 0x0505 ,
    FSSP_DATAID_RPM6       = 0x0506 ,
    FSSP_DATAID_RPM7       = 0x0507 ,
    FSSP_DATAID_RPM8       = 0x0508 ,
    FSSP_DATAID_ALTITUDE   = 0x0100 ,
    FSSP_DATAID_FUEL       = 0x0600 ,
    FSSP_DATAID_ADC1       = 0xF102 ,
    FSSP_DATAID_ADC2       = 0xF103 ,
    FSSP_DATAID_LATLONG    = 0x0800 ,
    FSSP_DATAID_CAP_USED   = 0x0600 ,
    FSSP_DATAID_VARIO      = 0x0110 ,
    FSSP_DATAID_CELLS      = 0x0300 ,
    FSSP_DATAID_CELLS_LAST = 0x030F ,
    FSSP_DATAID_HEADING    = 0x0840 ,
#if defined(USE_ACC)
    FSSP_DATAID_ACCX       = 0x0700 ,
    FSSP_DATAID_ACCY       = 0x0710 ,
    FSSP_DATAID_ACCZ       = 0x0720 ,
#endif
    FSSP_DATAID_T1         = 0x0400 ,
    FSSP_DATAID_T11        = 0x0401 ,
    FSSP_DATAID_T2         = 0x0410 ,
    FSSP_DATAID_HOME_DIST  = 0x0420 ,
    FSSP_DATAID_GPS_ALT    = 0x0820 ,
    FSSP_DATAID_ASPD       = 0x0A00 ,
    FSSP_DATAID_TEMP       = 0x0B70 ,
    FSSP_DATAID_TEMP1      = 0x0B71 ,
    FSSP_DATAID_TEMP2      = 0x0B72 ,
    FSSP_DATAID_TEMP3      = 0x0B73 ,
    FSSP_DATAID_TEMP4      = 0x0B74 ,
    FSSP_DATAID_TEMP5      = 0x0B75 ,
    FSSP_DATAID_TEMP6      = 0x0B76 ,
    FSSP_DATAID_TEMP7      = 0x0B77 ,
    FSSP_DATAID_TEMP8      = 0x0B78 ,
    FSSP_DATAID_A3         = 0x0900 ,
    FSSP_DATAID_A4         = 0x0910
};

// if adding more sensors then increase this value
#define MAX_DATAIDS 18

static uint16_t frSkyDataIdTable[MAX_DATAIDS];

//#ifdef USE_ESC_SENSOR_TELEMETRY
//// number of sensors to send between sending the ESC sensors
//#define ESC_SENSOR_PERIOD 7
//
//// if adding more esc sensors then increase this value
//#define MAX_ESC_DATAIDS 4
//
//static uint16_t frSkyEscDataIdTable[MAX_ESC_DATAIDS];
//#endif

typedef struct frSkyTableInfo_s {
    uint16_t * table;
    uint8_t size;
    uint8_t index;
} frSkyTableInfo_t;

static frSkyTableInfo_t frSkyDataIdTableInfo = { frSkyDataIdTable, 0, 0 };
//#ifdef USE_ESC_SENSOR_TELEMETRY
//static frSkyTableInfo_t frSkyEscDataIdTableInfo = {frSkyEscDataIdTable, 0, 0};
//#endif
//
//#define SMARTPORT_BAUD 57600
//#define SMARTPORT_UART_MODE MODE_RXTX
//#define SMARTPORT_SERVICE_TIMEOUT_US 1000 // max allowed time to find a value to send
//
//static serialPort_t *smartPortSerialPort = NULL; // The 'SmartPort'(tm) Port.
//static serialPortConfig_t *portConfig;
//
//static portSharing_e smartPortPortSharing;

enum
{
    TELEMETRY_STATE_UNINITIALIZED,
    TELEMETRY_STATE_INITIALIZED_SERIAL,
    TELEMETRY_STATE_INITIALIZED_EXTERNAL,
};

static uint8_t telemetryState = TELEMETRY_STATE_UNINITIALIZED;

//typedef struct smartPortFrame_s {
//    uint8_t  sensorId;
//    smartPortPayload_t payload;
//    uint8_t  crc;
//} __attribute__((packed)) smartPortFrame_t;
//
//#define SMARTPORT_MSP_PAYLOAD_SIZE (sizeof(smartPortPayload_t) - sizeof(uint8_t))

